In [2]:
import pandas as pd
import numpy as np

In [13]:
seri = pd.Series([11,21,13,41,15])
seri

0    11
1    21
2    13
3    41
4    15
dtype: int64

In [8]:
# serilerde column ismi yoktur

In [14]:
type(seri)

pandas.core.series.Series

In [15]:
seri.size

5

In [16]:
len(seri)

5

In [17]:
seri.ndim

1

In [19]:
seri.values

array([11, 21, 13, 41, 15])

In [20]:
[i for i in seri.values]

[11, 21, 13, 41, 15]

In [21]:
seri2 = pd.Series([11,21,13,41,15,11,21,13,41,15,11,21,13,41,15,11,21,13,41,15])
seri2

0     11
1     21
2     13
3     41
4     15
5     11
6     21
7     13
8     41
9     15
10    11
11    21
12    13
13    41
14    15
15    11
16    21
17    13
18    41
19    15
dtype: int64

In [24]:
seri2.head()

0    11
1    21
2    13
3    41
4    15
dtype: int64

In [25]:
seri2.head(3)

0    11
1    21
2    13
dtype: int64

In [27]:
# conda list komutu yuklu kutuphaneleri gormemizi saglar

In [28]:
seri2.tail()

15    11
16    21
17    13
18    41
19    15
dtype: int64

In [30]:
seri2.tail(3)

17    13
18    41
19    15
dtype: int64

In [35]:
pd.Series(list('clarusway'))

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [36]:
data = ['paris', 'london', 'ankara']
index = ['x', 'y', 'z']

pd.Series(data, index)

x     paris
y    london
z    ankara
dtype: object

In [38]:
pd.Series(['x', 'y', 'z'], ['paris', 'london', 'ankara'])

paris     x
london    y
ankara    z
dtype: object

In [39]:
dictt = {'A': 100, 'B': 150, 'C': 200}
pd.Series(dictt)

A    100
B    150
C    200
dtype: int64

In [40]:
kume = set([3,4,5,6,73,4,5,6,7,1,2])
kume

{1, 2, 3, 4, 5, 6, 7, 73}

In [42]:
pd.Series(list(kume))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7    73
dtype: int64

In [46]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany','Italy', 'Japan'])

In [47]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [48]:
ser1.index

Index(['USA', 'Germany', 'USSR', 'Japan'], dtype='object')

In [49]:
ser1.values

array([1, 2, 3, 4])

In [51]:
ser1.sort_index() # index'e gore siraliyor

Germany    2
Japan      4
USA        1
USSR       3
dtype: int64

In [53]:
ser2.sort_values() # degerlere gore siraliyor

USA        1
Germany    2
Japan      4
Italy      5
dtype: int64

In [54]:
ser1['Germany']

2

In [57]:
ser1[['Germany', 'Japan']]

Germany    2
Japan      4
dtype: int64

In [60]:
ser1.Japan # index'leri kapali parantez icerisinde yazarak value elde edilir
# value'lar ise . ile birlestirilirse index sonucunu verir

4

In [61]:
ser1.Germany

2

In [62]:
ser1 + ser2 # toplayabildiklerini topladi, toplayamadiklarinin NaN yazdi

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [12]:
panser = pd.Series(data   = [121, 200, 150, 99, 145, 120, 180],
                    index = ["terry", "micheal", "orion", "jason","adam", "thomas", "zack"])
panser

terry      121
micheal    200
orion      150
jason       99
adam       145
thomas     120
zack       180
dtype: int64

In [13]:
panser.jason

99

In [14]:
panser['jason']

99

In [15]:
panser[['orion', 'adam']]

orion    150
adam     145
dtype: int64

In [16]:
panser['orion': 'adam']

orion    150
jason     99
adam     145
dtype: int64

In [17]:
panser[2:5]

orion    150
jason     99
adam     145
dtype: int64

In [18]:
panser.keys()

Index(['terry', 'micheal', 'orion', 'jason', 'adam', 'thomas', 'zack'], dtype='object')

In [19]:
panser.index

Index(['terry', 'micheal', 'orion', 'jason', 'adam', 'thomas', 'zack'], dtype='object')

In [21]:
panser.values

array([121, 200, 150,  99, 145, 120, 180])

In [26]:
panser.values[0]

121

In [29]:
panser.keys()[0]

'terry'

In [30]:
panser.index[0]

'terry'

In [33]:
panser.items()

In [34]:
list(panser.items())

[('terry', 121),
 ('micheal', 200),
 ('orion', 150),
 ('jason', 99),
 ('adam', 145),
 ('thomas', 120),
 ('zack', 180)]

In [39]:
panser.isin([121, 99])

terry       True
micheal    False
orion      False
jason       True
adam       False
thomas     False
zack       False
dtype: bool

In [40]:
panser.jason = 190
# panser['jason'] = 190 yukaridakinin ayni islemi yapiyor

In [41]:
panser

terry      121
micheal    200
orion      150
jason      190
adam       145
thomas     120
zack       180
dtype: int64

In [43]:
panser[panser > 180] = 200
panser

terry      121
micheal    200
orion      150
jason      200
adam       145
thomas     120
zack       180
dtype: int64

In [44]:
'adam' in panser

True

In [45]:
'ahmet' in panser

False

In [46]:
121 in panser.values

True

In [20]:
################################################################

In [21]:
# %config IPCompleter.greedy=True
# !pip install ipython --upgrade
# !pip install jedi
# !pip3 install jupyter-tabnine
# !jupyter nbextension install --py jupyter_tabnine
# !jupyter nbextension enable --py jupyter_tabnine
# !jupyter serverextension enable --py jupyter_tabnine

In [22]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [23]:
data = [1,3,5,7,9]
data

[1, 3, 5, 7, 9]

In [25]:
df = pd.DataFrame(data, columns = ['col1'])
df

   col1
0     1
1     3
2     5
3     7
4     9

In [27]:
data2 = np.arange(1,24,2).reshape(3,4)
data2

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [28]:
df2 = pd.DataFrame(data2, columns = ['col1', 'col2', 'col3', 'col4'])
df2

   col1  col2  col3  col4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [30]:
df2 = pd.DataFrame(data2, columns = ['col1', 'col2', 'col3', 'col4'], index = ['a','b','c'])
df2

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [32]:
df2.ndim

2

In [33]:
type(df2)

pandas.core.frame.DataFrame

In [34]:
df2.size

12

In [35]:
df2.shape

(3, 4)

In [36]:
df2.index

Index(['a', 'b', 'c'], dtype='object')

In [37]:
df2.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [38]:
df2.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [40]:
df2.keys()

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [41]:
len(df2)

3

In [43]:
df2.col1

a     1
b     9
c    17
Name: col1, dtype: int64

In [44]:
df2['col1']

a     1
b     9
c    17
Name: col1, dtype: int64

In [45]:
###############################

In [47]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)
s1

array([5, 8, 7, 3, 6, 6, 9, 9, 3, 3, 5, 5, 3, 9, 3, 3, 7, 9, 4, 5, 4, 9,
       9, 9, 5, 3, 5, 7, 4, 3, 4, 5, 8, 4, 7, 9, 7, 9, 4, 5])

In [48]:
dictt = {'var1' : s1, 'var2' : s2, 'var3' : s3}

In [50]:
df3 = pd.DataFrame(dictt)
df3

    var1  var2  var3
0      5    88   106
1      8    41   144
2      7    31   131
3      3    40   128
4      6    78   142
5      6    65   138
6      9    51   111
7      9    84   118
8      3    80   133
9      3    86   138
10     5    88   121
11     5    52   113
12     3    65   126
13     9    89   138
14     3    93   143
15     3    97   113
16     7    70   109
17     9    86   134
18     4    62   136
19     5    53   134
20     4    58   145
21     9    66   148
22     9    71   112
23     9    58   106
24     5    65   125
25     3    98   138
26     5    92   125
27     7    35   146
28     4    52   114
29     3    56   136
30     4    49   142
31     5    99   148
32     8    90   118
33     4    82   100
34     7    96   106
35     9    31   115
36     7    65   124
37     9    65   123
38     4    55   123
39     5    40   122

In [51]:
df3[3:5]

   var1  var2  var3
3     3    40   128
4     6    78   142

In [54]:
df3[3:5]['var1']

3    3
4    6
Name: var1, dtype: int64

In [55]:
df4 = df3[3:5]

In [56]:
df4.index = ['a', 'b']

In [57]:
df4

   var1  var2  var3
a     3    40   128
b     6    78   142

In [58]:
df4.columns = ['x', 'y', 'z']

In [59]:
df4

   x   y    z
a  3  40  128
b  6  78  142

In [63]:
np.random.seed(101)
a = np.random.randn(5,4)
a

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [123]:
df5 = pd.DataFrame(a, index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df5

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
type(df5['W'])

pandas.core.series.Series

In [69]:
df5.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [70]:
df5[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [71]:
df5[['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [74]:
df5.loc[:,'W':'Y']

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [75]:
df5

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df5['Result'] = df5['W'] * df5['X'] + df5['Y'] ** 2 - df5['Z']
df5

          W         X         Y         Z    Result
A  2.706850  0.628133  0.907969  0.503826  2.020844
B  0.651118 -0.319318 -0.848077  0.605965 -0.094644
C -2.018168  0.740122  0.528813 -0.589001 -0.625047
D  0.188695 -0.758872 -0.933237  0.955057 -0.227320
E  0.190794  1.978757  2.605967  0.683509  6.485092

In [87]:
df5.drop('Result', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df5

          W         X         Y         Z    Result
A  2.706850  0.628133  0.907969  0.503826  2.020844
B  0.651118 -0.319318 -0.848077  0.605965 -0.094644
C -2.018168  0.740122  0.528813 -0.589001 -0.625047
D  0.188695 -0.758872 -0.933237  0.955057 -0.227320
E  0.190794  1.978757  2.605967  0.683509  6.485092

In [98]:
df5.drop('Result', axis=1, inplace=True)

In [99]:
df5

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
# del df5['Z']

In [100]:
df5.drop(['C','E'], axis = 0, inplace = True)
df5

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [101]:
m=np.random.randint(1,40, size=(8,4))
df6 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df6

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [103]:
df6.loc[2:6, 'var4']

2    16
3    37
4    11
5    23
6    23
Name: var4, dtype: int64

In [104]:
df6.index='a b c d e f g h'.split()
df6

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [109]:
df6.loc['c':'f']

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23

In [110]:
df6.loc['c':'f', 'var1':'var3']

   var1  var2  var3
c    13    18    12
d    34    30    25
e    20    36    31
f    21    28     9

In [111]:
df6.loc[['c','f'],['var1','var3']]

   var1  var3
c    13    12
f    21     9

In [112]:
df6.iloc[:]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [113]:
df6.iloc[1:4,2:4]

   var3  var4
b    16     1
c    12    16
d    25    37

In [127]:
df5

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [128]:
df5[df5['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [130]:
df5.loc[df5['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [131]:
df5[(df5['X'] > 0) & (df5['Z'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [138]:
filt = (df5['X'] > 0) & (df5['Z'] > 0)
df5.loc[filt]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [139]:
df5.loc[filt, 'X']

A    0.628133
E    1.978757
Name: X, dtype: float64

In [140]:
filt2 = df5.Z > 0
df5.loc[filt2, 'Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

##########################################################################

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [4]:
df.reset_index() # drop default olarak False, True dersem onceki indexi siler

  index         W         X         Y         Z
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288
4     E -1.012831  0.314247 -0.908024 -1.412304

In [5]:
df.reset_index(drop = True)

          W         X         Y         Z
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [6]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [7]:
df.reset_index(drop = True, inplace = True)
df

          W         X         Y         Z
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [8]:
new_index = np.arange(1000, 1005)
new_index

array([1000, 1001, 1002, 1003, 1004])

In [21]:
df['new_index'] = new_index

In [22]:
df

          W         X         Y         Z  new_index
A  0.496714 -0.138264  0.647689  1.523030       1000
B -0.234153 -0.234137  1.579213  0.767435       1001
C -0.469474  0.542560 -0.463418 -0.465730       1002
D  0.241962 -1.913280 -1.724918 -0.562288       1003
E -1.012831  0.314247 -0.908024 -1.412304       1004

In [25]:
df.set_index('new_index', inplace = True)

In [26]:
df

                  W         X         Y         Z
new_index
1000       0.496714 -0.138264  0.647689  1.523030
1001      -0.234153 -0.234137  1.579213  0.767435
1002      -0.469474  0.542560 -0.463418 -0.465730
1003       0.241962 -1.913280 -1.724918 -0.562288
1004      -1.012831  0.314247 -0.908024 -1.412304

In [27]:
new_ind = ['mx', 'my', 'mz', 'mw', 'mt']

In [28]:
df['col1'] = new_ind
df

                  W         X         Y         Z col1
new_index
1000       0.496714 -0.138264  0.647689  1.523030   mx
1001      -0.234153 -0.234137  1.579213  0.767435   my
1002      -0.469474  0.542560 -0.463418 -0.465730   mz
1003       0.241962 -1.913280 -1.724918 -0.562288   mw
1004      -1.012831  0.314247 -0.908024 -1.412304   mt

In [29]:
df.set_index('col1', inplace = True)
df

             W         X         Y         Z
col1
mx    0.496714 -0.138264  0.647689  1.523030
my   -0.234153 -0.234137  1.579213  0.767435
mz   -0.469474  0.542560 -0.463418 -0.465730
mw    0.241962 -1.913280 -1.724918 -0.562288
mt   -1.012831  0.314247 -0.908024 -1.412304

In [31]:
df.columns = ['aa', 'bb', 'cc', 'dd']
df

            aa        bb        cc        dd
col1
mx    0.496714 -0.138264  0.647689  1.523030
my   -0.234153 -0.234137  1.579213  0.767435
mz   -0.469474  0.542560 -0.463418 -0.465730
mw    0.241962 -1.913280 -1.724918 -0.562288
mt   -1.012831  0.314247 -0.908024 -1.412304

### Groupby

In [32]:
flights = sns.load_dataset('flights')

In [33]:
flights

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [35]:
flights.groupby('year').count()

      month  passengers
year
1949     12          12
1950     12          12
1951     12          12
1952     12          12
1953     12          12
1954     12          12
1955     12          12
1956     12          12
1957     12          12
1958     12          12
1959     12          12
1960     12          12

In [36]:
flights.groupby('year').sum()

      passengers
year
1949        1520
1950        1676
1951        2042
1952        2364
1953        2700
1954        2867
1955        3408
1956        3939
1957        4421
1958        4572
1959        5140
1960        5714

In [37]:
flights.groupby('year').max()

      passengers
year
1949         148
1950         170
1951         199
1952         242
1953         272
1954         302
1955         364
1956         413
1957         467
1958         505
1959         559
1960         622

In [40]:
flights[flights['year'] == 1949]

    year month  passengers
0   1949   Jan         112
1   1949   Feb         118
2   1949   Mar         132
3   1949   Apr         129
4   1949   May         121
5   1949   Jun         135
6   1949   Jul         148
7   1949   Aug         148
8   1949   Sep         136
9   1949   Oct         119
10  1949   Nov         104
11  1949   Dec         118

In [41]:
planet = sns.load_dataset('planets')

In [42]:
planet

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [43]:
planet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [44]:
planet.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [45]:
planet.describe(include = 'all')

,method,number,orbital_period,mass,distance,year
count,1035,1035.000000,992.000000,513.000000,808.000000,1035.000000
unique,10,NaN,NaN,NaN,NaN,NaN
top,Radial Velocity,NaN,NaN,NaN,NaN,NaN
freq,553,NaN,NaN,NaN,NaN,NaN
mean,NaN,1.785507,2002.917596,2.638161,264.069282,2009.070531
std,NaN,1.240976,26014.728304,3.818617,733.116493,3.972567
min,NaN,1.000000,0.090706,0.003600,1.350000,1989.000000
25%,NaN,1.000000,5.442540,0.229000,32.560000,2007.000000
50%,NaN,1.000000,39.979500,1.260000,55.250000,2010.000000
75%,NaN,2.000000,526.005000,3.040000,178.500000,2012.000000
max,NaN,7.000000,730000.000000,25.000000,8500.000000,2014.000000

In [46]:
planet.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [47]:
# planet.dropna() ile null degerler bulunan tum satirlari siler

In [48]:
planet.method

0       Radial Velocity
1       Radial Velocity
2       Radial Velocity
3       Radial Velocity
4       Radial Velocity
             ...
1030            Transit
1031            Transit
1032            Transit
1033            Transit
1034            Transit
Name: method, Length: 1035, dtype: object

In [49]:
planet.method.describe()

count                1035
unique                 10
top       Radial Velocity
freq                  553
Name: method, dtype: object

In [50]:
planet['method'].value_counts()
# planet.method.value_counts() da olur

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [52]:
planet['method'].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [55]:
planet.groupby('method').sum()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,2,1.262360e+03,0.00000,35.75,4023
Eclipse Timing Variations,15,4.276480e+04,10.25000,1261.44,18090
Imaging,50,1.418973e+06,0.00000,2166.91,76347
Microlensing,27,2.207500e+04,0.00000,41440.00,46225
Orbital Brightness Modulation,5,2.127920e+00,0.00000,2360.00,6035
Pulsar Timing,11,3.671511e+04,0.00000,1200.00,9992
Pulsation Timing Variations,1,1.170000e+03,0.00000,0.00,2007
Radial Velocity,952,4.553151e+05,1341.65638,27348.11,1110158
Transit,776,8.377523e+03,1.47000,134242.77,798461
Transit Timing Variations,9,2.393505e+02,0.00000,3313.00,8050

In [56]:
planet.groupby('method')['distance'].sum()

method
Astrometry                           35.75
Eclipse Timing Variations          1261.44
Imaging                            2166.91
Microlensing                      41440.00
Orbital Brightness Modulation      2360.00
Pulsar Timing                      1200.00
Pulsation Timing Variations           0.00
Radial Velocity                   27348.11
Transit                          134242.77
Transit Timing Variations          3313.00
Name: distance, dtype: float64

In [58]:
planet.groupby('method').distance.sum()

method
Astrometry                           35.75
Eclipse Timing Variations          1261.44
Imaging                            2166.91
Microlensing                      41440.00
Orbital Brightness Modulation      2360.00
Pulsar Timing                      1200.00
Pulsation Timing Variations           0.00
Radial Velocity                   27348.11
Transit                          134242.77
Transit Timing Variations          3313.00
Name: distance, dtype: float64

In [59]:
planet.groupby('method')[['distance']].sum()

                                distance
method
Astrometry                         35.75
Eclipse Timing Variations        1261.44
Imaging                          2166.91
Microlensing                    41440.00
Orbital Brightness Modulation    2360.00
Pulsar Timing                    1200.00
Pulsation Timing Variations         0.00
Radial Velocity                 27348.11
Transit                        134242.77
Transit Timing Variations        3313.00

In [61]:
planet.groupby(['method', 'year'])[['distance', 'orbital_period']].sum()

                                distance  orbital_period
method                    year
Astrometry                2010     14.98     1016.000000
                          2013     20.77      246.360000
Eclipse Timing Variations 2008    261.44     9088.000000
                          2009      0.00    10220.000000
                          2010   1000.00     8457.050000
...                                  ...             ...
Transit                   2014   2070.00      756.948471
Transit Timing Variations 2011   2119.00      160.000000
                          2012    855.00       57.011000
                          2013    339.00       22.339500
                          2014      0.00        0.000000

[69 rows x 2 columns]

In [62]:
planet.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [64]:
planet.describe().T
# planet.describe().transpose() da olur

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [66]:
planet.method

0       Radial Velocity
1       Radial Velocity
2       Radial Velocity
3       Radial Velocity
4       Radial Velocity
             ...
1030            Transit
1031            Transit
1032            Transit
1033            Transit
1034            Transit
Name: method, Length: 1035, dtype: object

In [69]:
planet.method.T

0       Radial Velocity
1       Radial Velocity
2       Radial Velocity
3       Radial Velocity
4       Radial Velocity
             ...
1030            Transit
1031            Transit
1032            Transit
1033            Transit
1034            Transit
Name: method, Length: 1035, dtype: object

In [70]:
planet[['method']].T

,0,1,2,3,4,5,6,7,8,9,...,1025,1026,1027,1028,1029,1030,1031,1032,1033,1034
method,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,Radial Velocity,...,Transit,Transit,Imaging,Transit,Imaging,Transit,Transit,Transit,Transit,Transit

In [71]:
# sadece dataframe'i transpose yapabiliyoruz

In [72]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C','A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99,40,20,15],
                   'var2': [100,253,333,262,111,969, 232,343,123]})
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    40   232
7      B    20   343
8      C    15   123

In [75]:
df6.groupby('groups').agg({'var1': min, 'var2': 'median'})

        var1  var2
groups
A         10   232
B         11   253
C         15   333

In [79]:
df6.groupby('groups').agg(['mean'])

       var1        var2
       mean        mean
groups
A        24  198.000000
B        18  235.666667
C        49  475.000000

In [80]:
eval('np.sqrt(9)') # string'leri anlasilir hale getiriyor

3.0

In [81]:
def kareal(x):
    return x ** 2

In [82]:
eval('kareal(100)')

10000

In [94]:
df6.groupby('groups').agg({'var1':['mean','median','sum'],
                          'var2':[min, max, 'std']})

       var1             var2
       mean median  sum  min  max         std
groups
A        24     22   72  100  262   86.185846
B        18     20   54  111  343  116.967232
C        49     33  147  123  969  440.513337

In [97]:
df6.groupby('groups').filter(lambda x : x['var1'].mean() > 19)
# burada var1'in mean'i 19'dan buyuk olan gruplarin elemanlarini gosteriyor

  groups  var1  var2
0      A    10   100
2      C    33   333
3      A    22   262
5      C    99   969
6      A    40   232
8      C    15   123

In [99]:
df6.groupby('groups').filter(lambda x : x['var2'].std() > 100)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    20   343
8      C    15   123

In [100]:
df6[['var1', 'var2']].transform(lambda x : (x - x.mean()) / x.std())

       var1      var2
0 -0.738296 -0.762940
1 -0.266271 -0.187601
2  0.096826  0.113229
3 -0.302581 -0.153758
4 -0.701987 -0.721576
5  2.493263  2.504835
6  0.350993 -0.266570
7 -0.375200  0.150833
8 -0.556748 -0.676452

In [101]:
df6[['var1', 'var2']].apply(lambda x : (x - x.mean()) / x.std())

       var1      var2
0 -0.738296 -0.762940
1 -0.266271 -0.187601
2  0.096826  0.113229
3 -0.302581 -0.153758
4 -0.701987 -0.721576
5  2.493263  2.504835
6  0.350993 -0.266570
7 -0.375200  0.150833
8 -0.556748 -0.676452

In [102]:
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    40   232
7      B    20   343
8      C    15   123

In [104]:
df6['groups'].map({'A':'adam', 'B':'bruce', 'C':'cobalt'})
# df['sex'].map({'male': 0, 'female': 1}) seklinde bir islem icin kullanilir map metodu

0      adam
1     bruce
2    cobalt
3      adam
4     bruce
5    cobalt
6      adam
7     bruce
8    cobalt
Name: groups, dtype: object

#############################################################################

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#%matplotlib inline

### recap for Apply - Transform - Map

In [2]:
np.random.seed(42)
dff = pd.DataFrame(  np.random.randn(5,4), 
                   index = ['A', 'B', 'C', 'D', 'E'], 
                   columns = 'W X Y Z'.split()          )
dff

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [8]:
dff2 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C','A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99,40,20,15],
                   'var2': [100,253,333,262,111,969, 232,343,123]})
dff2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    40   232
7      B    20   343
8      C    15   123

In [14]:
# make minmaxscaler
dff2[['var1']].transform(lambda x : (x - dff2['var1'].min()) / 
                       (dff2['var1'].max() - dff2['var1'].min()))

       var1
0  0.000000
1  0.146067
2  0.258427
3  0.134831
4  0.011236
5  1.000000
6  0.337079
7  0.112360
8  0.056180

In [15]:
dff2[['var1']].transform(lambda x : (x - x.min()) / 
                       (x.max() - x.min()))

       var1
0  0.000000
1  0.146067
2  0.258427
3  0.134831
4  0.011236
5  1.000000
6  0.337079
7  0.112360
8  0.056180

In [20]:
dff2[['var2']].apply(lambda x : (x - x.min()) / 
                       (x.max() - x.min()))

       var2
0  0.000000
1  0.176064
2  0.268124
3  0.186421
4  0.012658
5  1.000000
6  0.151899
7  0.279632
8  0.026467

In [22]:
dff2[['var1','var2']].transform(lambda x : (x - x.min()) / 
                       (x.max() - x.min()))
# transform yerine apply da kullanabilirim

       var1      var2
0  0.000000  0.000000
1  0.146067  0.176064
2  0.258427  0.268124
3  0.134831  0.186421
4  0.011236  0.012658
5  1.000000  1.000000
6  0.337079  0.151899
7  0.112360  0.279632
8  0.056180  0.026467

In [23]:
dff2.groupby('groups')[["var1","var2"]].transform(np.mean)

   var1        var2
0  24.0  198.000000
1  18.0  235.666667
2  49.0  475.000000
3  24.0  198.000000
4  18.0  235.666667
5  49.0  475.000000
6  24.0  198.000000
7  18.0  235.666667
8  49.0  475.000000

In [24]:
dff2.groupby('groups')[["var1","var2"]].apply(np.mean)

        var1        var2
groups
A       24.0  198.000000
B       18.0  235.666667
C       49.0  475.000000

```
(1) transform() works with function, a string function, a list of functions, and a dict. However, apply() is only allowed with function.
(2) transform() cannot produce aggregated results.
(3) apply() works with multiple Series at a time. But, transform() is only allowed to work with a single Series at a time.
```

In [39]:
dff2['var1'].transform(np.exp)
# transform aggregate yapilan fonksiyonlari calistirmiyor
# count, sum, min, max gibi fonksiyonlari

0    2.202647e+04
1    9.744803e+09
2    2.146436e+14
3    3.584913e+09
4    5.987414e+04
5    9.889030e+42
6    2.353853e+17
7    4.851652e+08
8    3.269017e+06
Name: var1, dtype: float64

In [40]:
# apply ile groupby yapmadan bir sutunda aggregate fonksiyonlar kullanilabilir
# transform'da ise groupby olmadan aggregate function kullanilmaz

In [51]:
dff2.groupby('groups').mean()

        var1        var2
groups
A       24.0  198.000000
B       18.0  235.666667
C       49.0  475.000000

In [57]:
dff2['var2'].mean()

302.8888888888889

In [59]:
dff2.groupby('groups').filter(lambda x : x['var2'].mean() > 200)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    20   343
8      C    15   123

In [54]:
dff2["groups"].map({"A":"adam","B":"bruce","C":"cobweb"}) # use replace

0      adam
1     bruce
2    cobweb
3      adam
4     bruce
5    cobweb
6      adam
7     bruce
8    cobweb
Name: groups, dtype: object

In [55]:
dff2["groups"].replace({"A":"adam","B":"bruce","C":"cobweb"})

0      adam
1     bruce
2    cobweb
3      adam
4     bruce
5    cobweb
6      adam
7     bruce
8    cobweb
Name: groups, dtype: object

In [58]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [60]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [62]:
titanic.groupby(['sex', 'pclass'])[['survived']].mean()

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [67]:
titanic.pivot_table(values = 'survived', index = ['sex'], columns = 'pclass')

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [68]:
titanic.groupby(['sex', 'pclass'])[['survived']].mean().unstack()

        survived
pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [70]:
titanic.groupby(['who','sex', 'pclass'])[['survived']].mean()

                     survived
who   sex    pclass
child female 1       0.666667
             2       1.000000
             3       0.533333
      male   1       1.000000
             2       1.000000
             3       0.321429
man   male   1       0.352941
             2       0.080808
             3       0.119122
woman female 1       0.978022
             2       0.909091
             3       0.491228

In [78]:
titanic.groupby(['who','sex', 'pclass'])[['survived']].mean().unstack()

              survived
pclass               1         2         3
who   sex
child female  0.666667  1.000000  0.533333
      male    1.000000  1.000000  0.321429
man   male    0.352941  0.080808  0.119122
woman female  0.978022  0.909091  0.491228

In [80]:
titanic.pivot_table(values = 'survived', index = ['sex', 'who'], columns = 'pclass', aggfunc='count')

pclass          1   2    3
sex    who
female child    3  10   30
       woman   91  66  114
male   child    3   9   28
       man    119  99  319

######################################################################

In [81]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [92]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [83]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [84]:
df.notnull()

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [85]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [86]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [87]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [88]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [93]:
df2 = df.append(pd.DataFrame([np.nan])).reset_index(drop=True)
df2

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN
3  NaN  NaN  NaN NaN

In [94]:
df2.dropna()

Empty DataFrame
Columns: [A, B, C, 0]
Index: []

In [95]:
df2.dropna(how='all')

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN

In [96]:
df2.dropna(how='all', axis=1)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  NaN  NaN  NaN

In [100]:
df2.dropna(thresh = 3, axis = 0)

     A    B    C   0
0  1.0  5.0  1.0 NaN

In [101]:
df2.dropna(thresh = 2, axis = 0)

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN

In [102]:
df2.dropna(thresh = 1, axis = 1)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  NaN  NaN  NaN

In [103]:
# thresh'da girilen sayi kadar nan olmayan deger varsa o satir kalir